app/controllers/gardens_controller.rb

    def index
        @gardens = Garden.all
---
SELECT "gardens".* FROM "gardens"